jacobdman/ride-puck/firmware/scoutos_display/sdkconfig.defaults
# ScoutOS ESP32-S3 defaults — adjust for your display board

CONFIG_IDF_TARGET="esp32s3"

# Bluetooth
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Log level (reduce in production)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Partition table
CONFIG_PARTITION_TABLE_SINGLE_APP=y
